{
    "IS1-20": {
        "pdf_name": "IS1-20",
        "paper_title": "",
        "content": {
            "序論": "製造・物流分野での労働力安定供給に向け，人の物理的な非定型作業を代替できるロボットの開発が求められている．さまざまな作業環境での代替実現には，作業環境の照明状況によらずに種々の物体を\n認識できる必要がある．そこで，本研究では，画像\nの局所的な鮮明度が照明条件によって変わること\nに着目し，局所鮮明度に応じて対象物の類似度\n評価方法を適切に自動選択する認識アーキテク\nチャを開発した．倉庫作業を模擬した実験系を組\nみ，撮像画像内の複数対象物の照明条件がそれ\nぞれ異なる状況下において，従来手法は認識率\nが 90%未満であるのに対し，提案手法では 98%\n以上の認識率を達成できることを確認した．1  背景・目的近年，先進国を中心として，消費者ニーズの多様化に伴い，多種多様な製品・商品を扱う工場・倉庫と，そこでの従業員の物理的作業が急増してきている．今後，この人手不足の傾向に拍車が掛かることが予想される中，工場・倉庫内作業の自動化技術に対する期待が高まっている．与えられた状況を理解し，その状況に対応するための多様な非定型作業をこなすことができる自律作業ロボットが求められている．本研究では，このような自律作業ロボットの認識技術の向上を目的とする．視覚センサを用いて対象となる物品を認識することで，物品に対する高度な作業を可能と\nすることをめざす．対象物品の位置姿勢を認識するための有用な手法の一つとして，局所的な模様の類似度を評価する\n手法が挙げられる[1]．この方法では，あらかじめ作\n成したマスタデータと撮像して得た対象物の間で局所的な模様情報の類似度を計算することで多種多様\nな物体の位置姿勢推定を可能とする．一方，模様の比較による物体認識の大きな技術課Copyright © SSII 2019. All Rights Reserved.- IS1-20 -題の一つとして，照明や影の映りこみによって対象物の認識精度が低下することが挙げられる．照明や影の映り込みによって物体の模様が不鮮明になると模様特徴が変化してしまい，結果として位置姿勢推定に失敗することがしばしば生じる．特に，認識結果に基づいて，ロボットが対象物品の把持動作を実施する場合には，位置姿勢推定の誤りによって，対象物品あるいはロボットの破損につながる恐れがある．この問題を解決する方法として，照明映り込み部分の模様を鮮明にするための画像修正技術も提案されているが，模様にグラデーションがある物体には適用で\nきないなど，その利用範囲は限定的である[2]．そこで，本研究では，照明変動によらずに対象物品の位置姿勢を正しく推定することを目的とし，画像の局所領域ごとに模様の鮮明度合いを計算し，その鮮明度に応じて適切な類似度評価方法を選択・実行\nする認識アーキテクチャを提案する．"
        },
        "date": "2019-06-10 00:00:00",
        "conf_name": "SSII2019"
    },
    "IS1-02": {
        "pdf_name": "IS1-02",
        "paper_title": "VAEGAN の再構成誤差と Discriminator の ROI を活用した異常検出",
        "content": {
            "序論": "近年，画像を活用した異常検出手法は数多く提案され\nており，不良品検出や，監視カメラからの危険人物の検\n出，医療の発病検知などの領域に応用されている [1{4]．\nその中でも，生成モデルで通常クラスの画像を十分\n学習させた後，生成モデルに画像を入力し生成された\n再構成画像と，入力画像との誤差画像を基に異常を検\n出する手法が代表的である．生成モデルとして Auto-\nEncoder (AE) を応用した異常検出手法 [5] や，Vari-\national Auto-Encoder (VAE) [6] を応用した手法 [7]，\nGenerative Adversarial Networks (GAN) [8] を活用し\nた手法 [9] が既に提案されている．その中でも，GAN\nを活用した手法 [9] は，精度が良いものの，識別時に再\n構成画像と入力画像との誤差の最小化計算のコストが\nかかる問題 [10] や，最小化中に初期値によっては局所\n解に陥ってしまう問題がある．そこで，VAE を用いて\nGAN の初期値を決めることで，常に入力画像に近い生\n成画像を出力する VAEGAN [11] の活用が必要である\nと考える．一方で，実世界での利用を想定した場合，入力画像\nにはノイズが多く含まれる．生成モデルでは平均的な\n画像を出力するため，入力画像にノイズが混入してい\nる場合，モデルはノイズの少ない画像を生成する．そ\nのため，ノイズ部には再構成誤差が生じる．前述した\n手法では，画像全体の再構成誤差の大きさにより判定\nを行っているため，異常に起因する誤差と，ノイズに\n起因する誤差を分ける必要がある．しかし，これらの\n手法では，その機構がない．すなわち，ノイズ部の誤\n差と本来の異常領域の誤差の区別ができなく，ノイズ\nへの頑健性が懸念される．そこで我々は以前，異常ク\nラスの一部を教示し，識別に必要となる領域に焦点を\n当てることで，ノイズに頑健な手法を提案した [12,13]．\nところが，異常画像の一部を事前に知り得る必要があ\nり，それらが未知の場合は根本的な問題となる．そこで本稿では，まず，先の局所解の問題を解決する\nために，VAEGAN を用いた異常値判検出手法を提案す\nる．次に，ノイズへの頑健性を向上させるために，VAE-\nGAN の Discriminator から Region-of-interest (ROI)\nを算出し，それを再構成誤差の重み付けに活用する手Copyright © SSII 2019. All Rights Reserved.- IS1-02 -図 1: 提案手法の概要図．‘0’ が正常クラスであり，‘4’\nの画像が入力された時の手法による異常度合いの違い．\nNa(cid:127)(cid:16)ve に VAEGAN を用いた手法では，ピンクの領域が\nノイズの有無に起因しているため，判別に悪影響を及\nぼしてしまう．法を提案する．そして，VAE，GAN を活用した従来手\n法と比較実験を実施し，評価する．提案手法の概略図\nを図 1 に示す．"
        },
        "date": "2019-06-10 00:00:00",
        "conf_name": "SSII2019"
    },
    "IS1-03": {
        "pdf_name": "IS1-03",
        "paper_title": "超音波厚さ測定の効率化のためのエコー検出手法",
        "content": {
            "序論": "橋梁や道路，トンネルなどの社会インフラは年々増加している．これらの設備は建設後，使用とともに徐々に老朽化するため，定期的な検査が必要である．一般的に，構造物の検査には非破壊検査が用いられており，特に内部欠陥や厚さの測定には超音波厚さ測定が用いられる．超音波厚さ測定はソーナーの原理と同じで，超音波が往復する時間差によって所定の位置の厚さ（長さ）を求める検査方法である．測定器具の取扱いや計測データの解釈には専門的知識及び時間を必要とするため，大規模な測定は困難\nである．このような課題に対し，本研究ではCNN によ\nり測定データから超音波エコーを検出し，厚さを求める手法を提案する．実験の結果，専門的知識を必要\nとしなくても 95%のデータの厚みを測定でき，本手法\nの有効性が確認できた．1  はじめに金属やコンクリートなどの厚さを測定する場合，ノギスやマイクロメータ等の物体を挟み込んで測定する厚さ測定器が使用される．測定対象物がタンクや配管など，物理的にこれらの測定器を使用できない場合は，非破壊検査手法のひとつである，超音波厚さ\n測定（UTM：Ultrasonic Thickness Measurement）が用\nいられることが多い．超音波厚さ測定とは，超音波探触子で発生した超音波を測定対象物に入射し，その反射波を計測することによって対象物の厚さを測定する検査方法である．超音波が測定対象物に垂直もしくは設定した任意の角度で入射し，所定の位置で反射することを前提とするため，測定器具の取扱いや計測データの読み取りに専門的技量を必要とする．そのため，超音波厚さ測定は他の非破壊試験と同様\nに，日本工業規格（JIS）で測定方法が規定されてい\nる[1]．また，各種法定検査では認定技術者による検\n査が求められている．一方，国土交通省の予測によCopyright © SSII 2019. All Rights Reserved.- IS1-03 -ると，高度経済成長以降に整備されたインフラ設備が今後一斉に老朽化するとされており，効率的な維\n持管理が喫緊の課題となっている．超音波厚さ測定や類似検査である超音波探傷試験では，探触子を自動で移動走査することによる自\n動計測システム[2]は開発されているものの，計測デ\nータから測定値を算出する部分には言及されていない．一般に，超音波厚さ測定では計測データ中の超音波エコーから測定対象物の厚さを求めているが，超音波エコーの妥当性は目視で確認している．その確認に多大な時間を要するため省力化が課題となっている．本研究では，超音波厚さ測定における計測\nデータから Convolutional  Neural  Network  (CNN)を\n用いて超音波エコーを検出し，厚さを算出する手法\nを提案する．2  超音波厚さ測定（UTM）超音波厚さ測定は，超音波探触子から発生した超音波パルスを測定対象物に入射し，その伝搬時間をもとに対象物の厚さを求める方法である．探触子で発生した超音波を効率よく測定対象物に入射させるために，対象物を水などの媒質内に沈めて測定されることが多い．ここでは，超音波パルスが対象物中を図 1 に示すように，厚さ(cid:1830)の測定対象物中に超音往復する時間を計測することで厚さを求める，パルス\n反射法について説明する．波探触子から超音波パルス T を送信したとき，T の一\n部は対象物の表面で反射し，探触子で受信される．図 1.  超音波厚さ測定の概略図"
        },
        "date": "2019-06-10 00:00:00",
        "conf_name": "SSII2019"
    },
    "IS1-04": {
        "pdf_name": "IS1-04",
        "paper_title": "歩行者群分割",
        "content": {
            "序論": "近年，自動車産業において交通事故減少や利便性向\n上のために自動運転のシステムが開発されている．自動\n運転の確立には，高度な周辺環境認識が重要となり，特\nに交通弱者である歩行者を認識することが極めて重要\nとなる．本研究では，逆光や夜間などの，照明変化に頑\n健な LIDAR を用いた歩行者検出に着目する．LIDAR\nを用いた歩行者検出では，2 人以上の歩行者群を検出す\nる方法は確立されてない．本研究では，2 人以上の歩行\n者群を適切に分割して単独歩行者として検出するため\nに，k-means++法 [1] による歩行者群分割を提案する．\nさらに，k-means++法の分割数を手動決定しなければ\nならない問題点を解決するため，シルエット値 [2] を用\nいる手法を提案した．2 LIDAR を用いた歩行者検出従来の LIDAR による歩行者検出の 1 つである，Ki-\ndono らによる歩行者検出 [3] について述べる．歩行者\n検出の流れを図 1 に示す．歩行者検出の大きな流れとし\nて，歩行者データと非歩行者データを用いた検出器の\n構築と，検出器による歩行者検出の 2 つに分けられる．図 1 歩行者検出の流れCopyright © SSII 2019. All Rights Reserved.- IS1-04 -第25回画像センシングシンポジウム2.1 LIDAR による三次元点群データの取得歩行者検出を行うために，まず，LIDAR を用いて三\n次元点群データを取得する．車載カメラ映像と取得した\nデータを可視化したものを図 2，図 3 に示す．可視化に\nは三次元点群情報を取り扱うことのできる Point Cloud\nLibrary(PCL) を利用している．図 2 車載カメラ映像図 3LIDAR による三次元点群データ2.2 路面平面の決定その後，取得した三次元点群データから路面平面を\n決定するために，PCL の平面検出を行い，以下の平面\nの方程式を得る．ax + by + cz = d(1)2.3 グリッドマップを用いた立体物検出路面平面を決定した後，グリッドマップを用いて立\n体物検出を行う．立体物の検出はまず，図 4 のような\n路面平面に平行なグリッドマップを作成する．その後，"
        },
        "date": "2019-06-10 00:00:00",
        "conf_name": "SSII2019"
    },
    "IS1-05": {
        "pdf_name": "IS1-05",
        "paper_title": "",
        "content": {
            "序論": "機械学習技術や IoT  (Internet  of  Things)，M2M \n(Machine  to  Machine)  によるセンサネットワークの広\nがりとともに，例えば日常生活での見守りサービスや，生産現場での生産性改善など，センサデータを用い\nた行動分析アプリケーションが提案されている．ところで，従来の行動分析技術は，その多くが教師あり学習に基づいて検討されている．教師あり学習は，事前に人手による教師データの作成等が必要であり，これにかかる手間と時間とが実用化の際には大\nきな課題となる．本稿では上記の課題を解決した行動分析アプリケーションの実現を目的として，教師なし学習に基づく\n行動分析アルゴリズムを提案する．提案手法が対象とするのは，とくに日常生活や生産現場等で見られる，同じ動作が繰り返される行動である．複数回繰り返された動作のセンサデータ同士を，動作要素ごとに分節化して比較することで，教師データを与えることなく，標準的な動作パターンを\n決定するとともに非標準動作を検出する．"
        },
        "date": "2019-06-10 00:00:00",
        "conf_name": "SSII2019"
    },
    "IS1-06": {
        "pdf_name": "IS1-06",
        "paper_title": "ドローンによる牧場空撮画像における乳牛の個体識別",
        "content": {
            "序論": "放牧における牛の監視作業は，労働の負担が大きい\n一方で，個体の状態を管理し病気や怪我の牛を早期発見\nするために重要である．本稿ではドローンを用いて撮影\nした空撮画像から乳牛の模様によって個体識別を行い，\nそれによる個体ごとの監視を目指す．空撮画像では牛\nの向きは不揃いであるが，牛の識別を行う際には，体の\n向きが揃っていた方が識別精度がよいと予測される．こ\nのため，畳込みニューラルネットワーク (CNN) である\nYOLOv3 を用いてまず牛の体と頭部を検出し，画像に\nおける牛の体軸整合を行う．その後 Siamese Network\nを用いて乳牛の模様の類似度による個体識別を行う．従\n来手法であるテンプレートマッチングと比較し，提案\n手法の有効性を確認した．1 はじめに畜産農家の作業時間の中で，大きな割合を占めるの\nは監視作業である．その中でも病気や怪我をした牛の\n早期発見が重要である．近年，一戸あたりの牛飼養頭\n数は増加する一方，労働人口は高齢化しており，農家\nの管理負担が増している．放牧の監視作業の負担を軽\n減するため，長期的なコストが少ない，保守運用が楽\nなどのメリットを持つコンピュータビジョンを用いた\n監視が注目されている．特に，広い範囲にわたる放牧\n地をカバーできるドローンによる空撮画像の使用が有\n望である．本稿は，ドローンによる空撮画像から乳牛の個体識\n別を目指す．これにより，遠隔地から牛を個体ごとに観\n察することが可能となり，農家の支援につながる．空\n撮画像では対象物が様々な向きで写されるが，個体識\n別のためには，体の向きが揃っている方が精度が良い\nことが期待される．そこで，YOLOv3 [1] を用いた牛の\n体と頭部の検出を行い，これに基づいて個体の向きを\n揃える体軸整合を行う．また，模様による個体識別に\nついては類似度学習を行う Siamese Network [2] を用い\nる．実験では，Siamese Network を用いる場合とテン\nプレートマッチングを用いる場合の比較を行い，また\nそれぞれでは体軸整合の処理の有無による比較も行う．Copyright © SSII 2019. All Rights Reserved.- IS1-06 -図 1: 手法の概要"
        },
        "date": "2019-06-10 00:00:00",
        "conf_name": "SSII2019"
    },
    "IS1-07": {
        "pdf_name": "IS1-07",
        "paper_title": "",
        "content": {
            "序論": "医療，建築の分野において，3 次元物体の形状を非接触で計測することは，利便性の面で重要である．現在の主な手法は、ステレオ画像法，光レーダー法，光切断法，照度差ステレオ法，焦点調節法，等高線\n計測法が存在する[1]．これらの手法の中で，等高線\n計測法に分類されるモアレトポグラフィがある．この手法は，身近な利用例を挙げると医療分野において，人体の骨格の形状を診断する際に用いられてきた．また，近年では格子や干渉縞の位相解析を行うことで，高精度になってきている．そして、モアレトポグラフィを基礎とし，デジタルカメラの走査線を利用した\nサンプリングモアレ法が考案されている[2]．本研究の目的は，上記のような非接触 3 次元形状\n計測によって患者の腹部や胸部の動態を認識し，緊\n急搬送中のトリアージ判定や ICU での継続的な容態\nモニタリングを実現することである．そのために，上記手法を動的な計測システムへと拡張する必要がある．\n本論文では，2 章でサンプリングモアレ法の原理を説\n明し，3 章でこれにアクティブステレオ法を組み込ん\nだ動的 3 時限形状計測手法を提案し，人の腹部に適\n用した実験結果を述べ，4 章で結論をまとめる．2  モアレトポグラフィ2.1  モアレ法すだれを二枚重ねると，元のすだれにない新しい縞模様が現れる場合がある．これをモアレ縞と言い，細かな縞どうしの干渉によって，より周波数の低い縞模様が見える現象である．そして，この干渉縞を使っ\nて計測を行う手法がモアレ法である．図 1(a)の等間隔の基準格子に，その格子が少し\n変形した図 1(b)の試料格子を重ねると，図 1(c)のよう\nに元の格子にない，より周波数の低い新たなモアレ\n縞が発生する．Copyright © SSII 2019. All Rights Reserved.- IS1-07 -基準格子の黒い線と試料格子の黒い線が重なった部分，基準格子の白い線と試料格子の白い線が重なった部分に，白い線ができている。また，基準格子の黒い線と試料格子の白い線が重なった部分，基準格子の黒い線と試料格子の白い線が重なった部分に，黒い線ができている．これがモアレ縞である．\nなお，図 1(b)の変形した試料格子をデジタルカメラな\nどで撮影しても，図 1(d)に示すようなモアレ縞が発生\nする場合がある．これは，後述するサンプリングモア\nレ法で利用される．一つの連なるモアレ縞は変形量の等しい等変位線となっているので，このモアレ縞を解析することにより，試料格子の変位やひずみを解析できる．これをモアレ法と言う．また，プロジェクター等を用い，基準格子を三次元物体に投影し，その物体を基準格子と重ねると，モアレ縞が発生する．この干渉縞を解析することで，本研究の目的である三次元形状を計測する\nことができる．これをモアレトポクラフィと呼ぶ[3]．図 1  等変位線を示すモアレ縞の説明:  (a)  基準\n格子，(b)  試料格子，(c)  図(a)と(b)の重ねあわせに\nよって生じるモアレ縞，(d)  デジタルカメラで撮影され\nた画像によって得られるモアレ縞，[2]より転載"
        },
        "date": "2019-06-10 00:00:00",
        "conf_name": "SSII2019"
    },
    "IS1-08": {
        "pdf_name": "IS1-08",
        "paper_title": "",
        "content": {
            "序論": "油圧ショベルに搭載した３台の単眼カメラの画像をリアルタイムに画像認識し、人らしい像があればモニタ表示と音で知らせる機能を開発した。動作イメージを図１に示す。油圧ショベルは人と比べて大型で、重量が大きく動きも速いうえ、走行だけでなく旋回動作もある。周辺に作業者や障害物が混在する現場では、安全確保のため、確実かつ広範囲の周辺確認が求められる。しかしながら、車体の左前方にある運転室からは、エンジンフードやカウンターウェイトが視界を遮るため、特に車体後方と右側方にオペレータから直接目視できない死角が多い。そこでミラーやカメラ\nで周辺確認を可能にする必要がある。従来機能の画像合成処理[1]  [2]は、油圧ショベルの後方、右側方、左側方に、広角、高感度でダイナミックレンジが広い単眼カメラを３台搭載し、それらの画像をリアルタイムに合成して運転室内のモニタに表示する事で、油圧ショベルの後方２７０度をひと目で確認可能にした。カメラ配置と合成画像の例を図２に示す。ＦＰＧＡによるパイプライン処理で、フレームレート低下なく画像を合成表示する。車体のごく近傍から地平線の上空までカバーする事で大型の物体も全体を映し出せる視野の広さ、旋回動作を伴う油圧ショベルに好適な円形画像、直感的な分かりやすさが特徴である。２０１１年に油圧ショベルのオプションとして\n販売を開始、その後標準装備とした。しかしながら、モニタ確認のタイミングはオペレータによって異なるため、例えば作業に集中してモニタから目を離しているすきに、周辺の作業者が油圧ショベルに接近してしまう状況が想定される。そこで、カメラ画像を認識して、人らしい像があればモニタ表示と音で知らせることで、オペレータに周辺確認のきっかけを与える機能を開発した。既設の単眼カメラの画像認識のみで、ローコストで簡便なシステム構成としながら、合成映像がカバーする範囲全体を画像認識する事が目的である。本稿ではこれらを実現するにあたCopyright © SSII 2019. All Rights Reserved.- IS1-08 -っての技術課題と解決方策、および実際の動作事例\nを紹介する。2  目標・課題開発目標は以下とした。本章では、目標達成のための技術課題を説明する。目標１.  画像認識のみによる人らしさ評価 \n目標２.  ３方向のカメラ画像を毎秒１０回以上認識 \n目標３.  小型で安価な車載装置2.1  画像上での人の見かけ変化 \n背景と服装の色のコントラスト、上半身と下半身で色が異なる服装、携行品、カメラに対する位置や向き、ポーズなど、画像上の人の見かけは多様に変化する。また、人の身長よりも高い油圧ショベルの車体上面にカメラを設置するため、人がカメラに接近した場合と離れた場合では、像の大きさだけでなく、頭と体の像の比率など見かけが変化する。画像の例を図３に示す。本開発では想定する人を歩行者に限定したが、それでもあらゆる見かけ変化を想定して人らしさを数\n値化するアルゴリズムの手動設計は困難である。2.2  広角カメラ画像の歪み \n後方カメラと側方カメラの境界部も隙間無く撮影するために広角カメラを採用し、車体のごく近傍から遠方までをカバーするために斜め下向きに設置する。これにより視野の左右端では物体の像が傾いて映り、視野の下端には車体の像が映りこむ場合がある。画像の例を図４に示す。人らしさを評価するために像を囲む注目領域を設定すると、一部が画像範囲外や\n車体の像に及び、画像情報が欠損する。2.3  画像認識処理サイクルの高速化と安定化 \n計算回数が多い画像認識処理を安定した時間サイクルで実行し続ける必要がある。ＦＰＧＡでハード化して処理時間のばらつきを低減するが、ローコストな"
        },
        "date": "2019-06-10 00:00:00",
        "conf_name": "SSII2019"
    },
    "IS1-09": {
        "pdf_name": "IS1-09",
        "paper_title": "",
        "content": {
            "序論": "畳み込みニューラルネットワーク  (CNN)  を用いた\nセマンティックセグメンテーションはコンピュータビジョンにおける基本的な問題の一つである．本稿では，\nEncoder-Decoder 構 造 の ネ ッ ト ワ ー ク に 導 入 す る\nClass の観点からの Attention 機構を提案する．  Class\nの観点からの Attention 機構では，クラス領域を学習\nしながら復元された特徴情報に注目する．これにより各クラスのセグメンテーションに重要な特徴情報に焦点を当てるようになるため，より正確に結果を生成す\nることが可能となる．本稿では CamVid データセットを\n用いて評価し，従来手法よりも高い精度が得られた．1  はじめに画像内の各画素に対してクラス推定を行うセマン\nティックセグメンテーション[2,  3,  5]は，コンピュータビ\nジョンにおける基本的な問題の一つであり，自動運転や医学など様々な分野に応用され始めている．近年，画像認識問題において非常に高い認識精度を\n実現した畳み込みニューラルネットワーク(CNN)[1]に\n基づいた Encoder-Decoder 構造を採用した手法が数\n多く提案されている．従来のセマンティックセグメンテーション手法では，あるクラスに属する物体の一部を異なるクラスであると誤って識別してしまうことがある．これは画像内に存在する各物体を画素単位で学習していたため，クラス間の区別が上手く出来ていないことが原因であると考えられる．この問題を対処する\nため，Encoder-Decoder 構造のネットワークに導入す\nる Class の観点からの Attention 機構を提案する．Class の観点からの Attention 機構は，セグメンテー\nションのために各クラス領域を学習しながら，それらを用いて特徴情報に注目する工程である．これにより重要な特徴情報のみ逐次焦点を当てるようになるた\nめ，より正確に結果を生成することが可能となる．実験では，車載カメラにより撮影された画像を 11 クCopyright © SSII 2019. All Rights Reserved.- IS1-09 -堀田  一弘ラスでラベル付けされた CamVid データセット[4]を使\n用し，評価指標には IoU(Intersection over Union) [5]\nを用いた．その結果，提案手法は従来のセグメンテ\nーション手法よりも高い精度を得ることができた．本論文は以下のように構成される．2 節では関連\n研究，3 節では提案手法について述べる．また，4 節\nで評価実験の結果を示し，5 節にまとめを述べる．"
        },
        "date": "2019-06-10 00:00:00",
        "conf_name": "SSII2019"
    },
    "IS1-10": {
        "pdf_name": "IS1-10",
        "paper_title": "ベクタ型レーザ投影における自己位置推定のためのマーカ埋め込み手法の検討",
        "content": {
            "序論": "自転車競技を始めとした広域で高速に動くスポーツ\nにおいて, ユーザへの情報提示並びに誤差蓄積のない光\n学的な姿勢推定を一つのシステムで同時に行うことは\n一般に困難である. 本稿では, ベクタ型レーザ投影によっ\nて人への情報提示と高速カメラの姿勢推定のためのマー\nカー提示を両立させる手法を検討する. これは, 人への\n提示曲線を時空間的に分割することで高速カメラから\nはマーカとして利用できるが, 人間にはマーカであるこ\nとを知覚されにくい描画を実現するものである. 実験で\nはスクリーンへ提案手法で描画される円を投影し, 静止\n状態の高速カメラから撮像した動画を用いてカメラの\n姿勢推定を行い, 姿勢推定精度を評価した.1 はじめにスポーツにおける身体・使用機材のセンシングとフィー\nドバック技術が, 競技力向上を目的として重要性を増し\nている. 自転車競技タイムトライアル種目においては,\n選手と機材の物理的・生理学的なモデルからペース配\n分を最適化できることが知られている [1]. 中でもトラッ\nク種目においては, 路面抵抗を一定とみなすことができ,\n路面のトポロジも事前に調べられることから, 物理モデ\nルによって非常に正確な予測ができる可能性がある [2].\n一方で高速に周回しているという性格上, 自転車はほと\nんど傾いているため, 地面に対する自転車の姿勢推定が\nモデルの入力として重要となる.これらの最適化は従来オフラインで行われ, 選手は事\n前に算出された数値を競技前に記憶することによって活\n用してきた. 一方で, 競技者に音声 [3] や触覚振動 [4] に\nよって即時フィードバック [5][6] を与えれば, より効率\n的な競技結果の向上が期待される. 本研究ではこれらを\nトラックで実現するために, 高速 (~20m=s) かつ広範囲\n(~100m 四方) で移動する自転車の姿勢推定と, 乗車して\nいる人間への情報提示を同時に実現するためのマーカ\nを提案する.このマーカを利用する系は, 将来的に図 1 に示す構\n成を想定している. 環境側に設置するレーザプロジェクCopyright © SSII 2019. All Rights Reserved.- IS1-10 -図 1 将来的な全体像図 2 ベクタ型レーザプロジェクションの例タ, 投影された提示画像, ユーザを含む移動体（自転車）\nに取り付ける高速カメラからなる. ベクタ型レーザプロ\nジェクションとは, ガルバノミラーに代表される機構に\nよってレーザの光軸を高速に制御して描くことのでき\nる線分を用いた画像投影手法を指し, 図 2 に例を示す.\n姿勢推定を行うためのマーカは, 情報提示のための画像\n中に埋め込まれ, ユーザに意識されることなく, 移動体\nにとりつけた小型の高速カメラからはデコードするこ\nとができる. 本論文では, このマーカの埋め込み手法と,\n静止状態における姿勢推定の安定性の評価を行う."
        },
        "date": "2019-06-10 00:00:00",
        "conf_name": "SSII2019"
    },
    "IS1-11": {
        "pdf_name": "IS1-11",
        "paper_title": "CNN を用いた固有画像分解による低光量画像の視認性改善",
        "content": {
            "序論": "固有画像分解は，入力画像を照明成分と反射率成分\nに分解する手法である．反射率成分を正確に推定する\nことは，環境光による外乱を最小限に抑えることに相当\nする．画像を照明成分と反射率成分の積として表現する\nRetinex 理論を基礎として，近年では畳み込みニューラ\nルネットワーク (CNN) を用いた手法が提案されている．\n正解画像を大量に用意することが著しく困難なこの問題\n設定において，人工的に合成した画像を用いる従来手法\nでは，その結果に色ムラやにじみなどの不自然さが見ら\nれた．本研究では，Encoder-Decoder 構造の CNN と，\nその入力に Generative Adversarial Networks(GAN) に\nよって生成した画像群を用いる枠組みを提案する．CNN\n構造の最適化に加え，実世界における環境光のデータ\n分布に基づき生成した画像群を入力とすることで，低\n光量のテスト画像に対して，従来手法と比較してより自\n然で視認性の高い反射率画像を得た．セマンティック・\nセグメンテーションによる評価実験では，本手法で得\nた反射率画像を用いて学習およびテストを行うことで，\n環境光が画素値に与える悪影響が緩和され，識別精度\nが向上することを確認した．2 はじめに一般物体認識やセマンティック・セグメンテーション\nをはじめとするコンピュータビジョンのタスク全般に\nおいて，その精度に悪影響をもたらす外乱として，シー\nンの照明状況が挙げられる．画像を通して観測される\n物体の色情報は照明状況に強く依存し，環境変化が激\nしい実空間において問題となる．特に，環境光の乏し\nい暗部あるいは逆光条件下において物体の色情報は大\nきく失われ，有効な画像特徴を抽出するにあたって障\n害となる．そのため，画像の視認性を改善させる画像\n処理技術への需要は高く，古くから活発に研究されて\nいる分野である．\n　一方，人間の視覚にはこのような外乱に適応する能\n力が備わっており，異なる照明状況下においても同様に\n物体を知覚できることが知られている．例えば，赤い\nリンゴを明るい部屋と暗い部屋で撮影した場合を考えCopyright © SSII 2019. All Rights Reserved.- IS1-11 -(a) 入力画像 S(b) 反射率画像 R(c) 照明画像 I図 1: 固有画像分解ると，リンゴの領域の RGB 画素値は部屋の明暗によっ\nて大きく異なるはずだが，人間はどちらの環境におい\nてもリンゴは同じく赤いものであるとして知覚できる．\nこの視覚特性は色恒常性と呼ばれ，物体の色や明るさ\nをその周辺との分光反射率の比のみで知覚することで，\n変化する照明状況に対して見え方が自動的に補正され\nるという性質をあらわしている．\n　この人間が持つ色恒常性をコンピュータビジョンに\n応用する手法として，固有画像分解 (図 1) が挙げられ\nる．シーンで撮影された入力画像 (a) を，物体の反射\n率を RGB 値に変換した反射率画像 (b) と，物体の色成\n分を一切持たず環境光のみに依存する照明画像 (c) に分\n解する．反射率画像を正確に推定することは，環境光\nによる外乱の影響を最小限に抑えることと同義であり，\nコンピュータビジョンにおいては，固有画像分解によっ\nて人間の色恒常性のようなロバスト性を実現できると\n考えられる．\n　多くの有用な固有画像分解手法は Retinex 理論 [1] [2]\nを基礎にしている．Retinex は Retina (網膜) と Cor-\ntex(大脳皮質) を合わせた造語で，人間の脳による光や\n色の知覚をモデル化する．Retinex 理論では，入力画像\nS と反射率画像 R，照明画像 I の関係を次の式であら\nわす．S = R・I(1)式 (1) は 2 つの未知変数を持つ不良設定問題であるた\nめ，1 枚の入力画像から Retinex 理論による固有画像分\n解を行うためには，何らかの仮定を設ける必要がある．\n実用上は，照明成分の勾配に滑らかさを仮定して，入\n力画像に平滑化フィルタを畳み込んだ結果を照明画像"
        },
        "date": "2019-06-10 00:00:00",
        "conf_name": "SSII2019"
    },
    "IS1-12": {
        "pdf_name": "IS1-12",
        "paper_title": "冗長 DCT による高効率な周波数フィルタリング",
        "content": {
            "序論": "デジタル画像処理技術は幅広い分野において様々な\n用途で活用されるようになり，様々なアプリケーショ\nンが登場している．多くのアプリケーションにおいて，\n高品質な画像の撮像は高性能化に不可欠である．しか\nし，カメラの CCD の微細化や画像の高画素化が進んで\nおり，回折現象によるボケの発生，そして画素あたりの\nノイズレベルの増加による画像の品質低下に繋がって\nいる．そこで，多くのアプリケーションの高性能化に\nおいては画像のノイズ除去やボケ除去アルゴリズムの\n高精度化が重要となる．また，ノイズ除去やボケ除去\nの結果はアプリケーション全体の基盤となるため，全体\nの処理のボトルネックとなることが多い．しかし，ノ\nイズ除去やボケ除去には処理精度と計算コストの間に\nトレードオフがあり，数多く存在する高精度な処理手\n法は計算コストが高いという問題点を持つ．そのため，\nリアルタイムな動画像処理を行うことが多くなった現\n代においては，処理精度と計算コストのバランスが良\nい手法の検討が不可欠である．ノイズ除去手法においては BM3D [1] が state-of-the-\narts の性能を持つ手法として知られている．そして，こ\nの BM3D の簡易版である離散コサイン変換 (Discrete\nCosine Transform: DCT) を利用した，DCT デノイジ\nング [2] はノイズ除去精度と計算コストのバランスに優\nれた手法である．そこで，本研究ではノイズ除去精度が高く実用的な\nノイズ除去手法の実現を目指し，DCT デノイジングの\n高速化を行った．本概要ではまず，高速 DCT アルゴリ\nズムである AAN [3] の適用，そして実装上の高速化手\n法について提案 DCT デノイジングの高速化について説\n明する．"
        },
        "date": "2019-06-10 00:00:00",
        "conf_name": "SSII2019"
    },
    "IS1-13": {
        "pdf_name": "IS1-13",
        "paper_title": "車載向け FPGA 搭載に向けたコンパクトな Residual Network による人物検知",
        "content": {
            "序論": "カメラと 3D LiDAR のセンサフュージョンにより，セ\nンサ単体の歩行者認識より性能が高く，かつ車載マイコンによる実用的なシステムを可能とすべく，本開\n発を行った[1]．一般的に，歩行者は奥行き方向，横向き方向それぞれ類似した動作であるが，我々はより複雑な動作\n(荷物を運ぶ，しゃがみなど)の場合の人物も認識でき\nるシステムの開発を目指している。このため，識別処理により性能が高いものが必要になり，かつ処理時間の課題が発生することが容易に想定できたため，識別処理にディープラーニングを選定し，さらにこれ\nを  FPGA へ搭載することで，これらの課題を解決した．"
        },
        "date": "2019-06-10 00:00:00",
        "conf_name": "SSII2019"
    },
    "IS1-14": {
        "pdf_name": "IS1-14",
        "paper_title": "ハイパースペクトル画像を用いた土壌の走破性の判定",
        "content": {
            "序論": "現在，日本では土砂災害が多発している．土砂災害\nの発生後にさらなる被害の拡大を阻止するためには迅\n速な復旧工事が必要であり，迅速な復旧工事のために\nは，建設機械を使用する必要がある．土砂災害の現場\nで建設機械を活用するためには，最初に，現場での建\n設機械の走破性を素早く調査する必要がある. 走破性\nの調査については，走破性の指標の 1 つであるコーン\n指数を測定して行うことが多い [1]．しかし，災害現場\nでは，二次災害の危険性が存在し，現場に人が立ち入\nることは難しいため，無人で走破性を調査することが\n望ましい．無人で走破性を調査する先行研究には，無\n人地上車両（UGV）にコーン指数を測定する機器を搭\n載して遠隔操作した研究がある [2] [3]．しかし，この\n手法では，走破性の調査に多くの時間が必要となるだ\nけでなく，さらに，UGV が進入できない場所の調査は\n不可能である．従って，この手法では適用可能な土砂\n災害が限定されてしまう可能性が大きい．一方，画像\nを使用して走破性を判定することが可能となれば，短\n時間での判定が可能となるだけでなく，さらに UGV や\n人の進入が困難な場所の走破性についても，その外側\nから撮影した画像さえあれば判定が可能となる．画像\nを使用して走破性を判定する先行研究には，可視近赤\n外，短波長赤外，長波長赤外の波長を撮影出来るカメ\nラを使用した研究がある [4] [5]．しかし，これらの先行\n研究では，含水比と走破性の関係にのみ注目しており，\n走破性に影響すると考えられる土壌の種類には，注目\nしていない．そこで，本研究では，画像から土壌の種類の判別と含\n水比の推定の双方を行うことによって，土壌の走破性\nを判定することを目的とする．なお，一般的な RGB 画\n像では土壌の種類の判別ならびに，含水比の推定を同\n時に行うことが不可能であると考えられるので，ハイ\nパースペクトル画像を使用することとした．ハイパー\nスペクトル画像の分類には，最尤推定法や多変量解析Copyright © SSII 2019. All Rights Reserved.- IS1-14 -が使用されることが多い．しかし，ニューラルネット\nワークの方が，学習データやラベルの定義に左右され\nにくく [6]，重要な特徴量を自動で探索できることが知\nられている [7]．そこで，本研究では, ニューラルネッ\nトワークを利用し，土壌のハイパースペクトル画像を\n分類することとした．本稿では，土壌の走破性を判定\nする手法を提案すると共に，複数の土壌を用いて実施\nした走破性判定試験について述べる．"
        },
        "date": "2019-06-10 00:00:00",
        "conf_name": "SSII2019"
    },
    "IS1-15": {
        "pdf_name": "IS1-15",
        "paper_title": "個人情報が保護された人物対応付けにおける",
        "content": {
            "序論": "安心安全な社会の実現のために，防犯や捜索など様々\nな応用を目的として複数カメラを用いた広域見守りシ\nステムが必要とされている．このシステムは高精度な\n人物対応付けの手法によって実現される．人物対応付\nけには人物画像から抽出された人物に固有の特徴量を\n使用し，特徴量間の距離を総当たりで計算する．そのた\nめカメラ台数や被写体人数の変化により，処理負荷が\n大きく増減する．このシステムにスケーラビリティを\n持たせるため，クラウド上の計算サーバを用いてサー\nバ上で人物対応付けを行うことが考えられる．しかし，\n人物対応付けに使用する特徴量は，人物を特定できる\nため個人情報に該当する．よってクラウド上の計算サー\nバを用いる場合，個人情報である特徴量を暗号化し，第\n三者からはアクセスできない形で取り扱うことが求め\nられる．人物対応付けをクラウド上の計算サーバで安全に行\nうことを目指し，特徴量を準同型暗号 [1] により保護す\nることを考える．準同型暗号を用いることで，暗号化さ\nれた特徴量をサーバ上で復号化することなく，距離計\n算を行うことができる．準同型暗号を用いたパターン\n認識の手法として，主成分分析への適用例 [2] や，深層\n学習への適用例 [3] が報告されている．本稿では，特徴\n量間の距離計算に準同型暗号を適用するシステムにつ\nいて議論する．暗号化された人物対応付けの流れを図 1\nに示す．検出した人物画像から特徴量を抽出し，その\n特徴量を準同型暗号により保護してからクラウドサー\nバ上へ送り距離計算を行う．準同型暗号を施して計算\nを行う場合，暗号化せずに計算を行った場合と比較し\nて処理時間が増大してしまう．そのため距離計算の回\n数を減らす工夫が必要となる．距離計算の回数は，人\n物対応付けに使用する人物画像の枚数によって決まる．\n人物画像の枚数は，一人の人物に対してカメラ視野内\nに存在している間に増加していく．本稿では，人物対応付け精度を保ったままカメラ視野\n内で多数獲得される同一人物の画像枚数を削減し，準Copyright © SSII 2019. All Rights Reserved.- IS1-15 -図 1 特徴量を保護した人物対応付け同型暗号を用いて特徴量を保護する人物対応付けシス\nテムを開発する．そのために各地点で見え方が類似し\nた人物画像を選択することを指針とし，人物画像選択\nのための基準を作成し，検出した全ての人物画像から\n基準に沿う画像のみを選択する．基準には，人物の姿\n勢を用いる．基準姿勢を用いて人物画像を選択するこ\nとで，人物対応付け精度を保ったままで人物画像枚数\nの削減が可能であるか確認をするために実験を行った．\n以下，2 章では画像選択の関連研究について述べる．次\nに 3 章では提案システムで用いる人物画像選択の手法\nについて述べ，4 章で人物画像選択を用いた提案システ\nムについて述べる．そして 5 章で独自データセットを\n用いた人物画像選択の評価実験について述べる．最後\nに，6 章でまとめる．"
        },
        "date": "2019-06-10 00:00:00",
        "conf_name": "SSII2019"
    }
}